{
  "ABOUT": "ABOUT",
  "ABOUT_PARAGRAPHS": [
  "I am a developer specializing in creating interactive and accessible applications, with a good knowledge of frontend technologies such as React.js, Next.js, and TypeScript.",

  "My technical skills include expertise in HTML, CSS, SCSS, and JavaScript frameworks, along with a solid understanding of backend technologies like Node.js, GraphQL, REST, and TypeORM. I have hands-on experience in database management with PostgreSQL, MongoDB, and SQLite. Additionally, I have worked with Docker and implemented CI/CD pipelines using GitHub Actions to optimize deployment processes.",

  "Throughout my professional journey, I have worked on a mobile e-commerce application built with React and Ionic, where I contributed to creating reusable components, implementing key features, and improving accessibility. I collaborated in an Agile environment using tools like Jira and performed unit testing with Jest to ensure code quality.",

  "Before diving into coding, I had a first career as a professional pianist, graduating from the conservatory. Music is still a part of my daily life and continues to fuel my creativity in development.",

  "In my free time, I enjoy hiking and reading."
  ],
  "CONTACT": "CONTACT",
  "CV_LINK": "View Full Résumé",
  "CV_LINK_ARIA_LABEL": "View Full Résumé (Opens in a new tab)",
  "EMAIL": "E-mail",
  "EMAIL_INVALID": "Invalid email address",
  "EMAIL_REQUIRED": "Email is required",
  "ERROR_MESSAGE": "An error occurred while sending your message. Please try again.",

  "EXPERIENCE": "EXPERIENCE",
  "EXPERIENCES": [
    {
      "TITLE": "Web and Mobile Developer (Apprentice)",
      "COMPANY": "CMA CGM",
      "DATE": "2023 — 2024",
      "DESCRIPTION": "As a Web Developer apprentice at CMA CGM, I joined the team at the beginning of a major project migration, transitioning from Angular to Ionic React while implementing a completely new design. My role was to contribute to the development of a mobile e-commerce application, ensuring high-quality user experience and performance. I was responsible for developing and maintaining reusable React components, implementing new features, and optimizing the application for accessibility. Working in an Agile environment, I collaborated with designers, backend developers, and project managers to align development with business requirements. I participated in code reviews, debugging, and performance optimizations to enhance overall functionality. Additionally, I wrote unit and integration tests using Jest and Testing Library to ensure code reliability, maintainability, and prevent regressions. My work helped improve the application's overall stability.",
      "TECHNOLOGIES": ["Ionic", "React", "TypeScript","MobX", "JavaScript", "HTML", "CSS"]
    }
  ],
  "FULL_NAME": "Full name",
  "MESSAGE_MAX": "Message must be at most 1000 characters long",
  "MESSAGE_MIN": "Message must be at least 100 characters long",
  "MESSAGE_REQUIRED": "Message cannot be empty",
  "MY_NAME": "Kolomiiets Yuliia",
  "NAME_REQUIRED": "Name is required",
  "PROJECTS": "PROJECTS",
  "PROJECTS_LIST": [
    {
      "NAME": "City Guide App",
      "DESCRIPTION": "A web app designed to help users explore cities by providing comprehensive location-based information. Developed from scratch as part of my final project at WildCodeSchool, this application allows users to discover key places, landmarks, restaurants, and other attractions. I was responsible for the full development lifecycle, from requirement analysis and software architecture to UI/UX design and backend integration. The app follows Agile methodology, utilizing Trello for project management. It features an intuitive interface, optimized performance, and an accessible design. Additionally, I implemented unit, integration, and end-to-end testing using Jest, React Testing Library, and Playwright to ensure code reliability and stability. Continuous integration and deployment were set up using GitHub Actions.",
      "TECHNOLOGIES": ["TypeScript", "Next.js", "React", "MUI", "Node.js", "GraphQL", "TypeORM", "PostgreSQL", "Docker", "Jest", "Playwright"],
      "IMAGE_ALT": "City guide App search page"
    },
    {
      "NAME": "Twitter Clone",
      "DESCRIPTION": "A full-stack web application replicating core Twitter functionalities, built using Node.js, Pug, Bootstrap, and MongoDB. This project provides user authentication, tweet creation, likes, and retweets, following the typical social media interaction model. The backend is powered by Node.js and Express, with MongoDB and Mongoose handling data storage and management. Pug is used for server-side rendering, ensuring a lightweight and efficient UI. Saas used for the styling, providing a responsive design. The project follows the MVC architecture, emphasizing modular and maintainable code. This clone was developed as a way to deepen my understanding of backend development, database interactions, and server-side rendering.",
      "TECHNOLOGIES": ["Node.js", "Express", "Pug", "SAAS", "MongoDB", "Mongoose", "JavaScript"],
      "IMAGE_ALT": "Node js picture"
    },
    {
      "NAME": "Quori",
      "DESCRIPTION": "Quori is a web application inspired by Quora, developed using Symfony. It allows users to ask and answer questions, vote on the relevance of both questions and answers, and search for specific topics. The platform includes user authentication, profile management, and a password reset system with token-based authentication. The backend is powered by Symfony with Doctrine for database management, while the frontend is built using Twig and SASS for styling. Webpack Encore is used for asset management, and TypeScript enhances the interactivity of the application.",
      "TECHNOLOGIES": ["PHP", "Symfony", "Twig", "Doctrine", "Webpack Encore", "SASS", "TypeScript", "MySQL"],
      "IMAGE_ALT": "PHP picture"    
    }    
  ],
  "PROJECTS_ARCHIVE_LINK": "View Full Project Archive",
  "PROJECTS_ARCHIVE_LINK_ARIA_LABEL": "View Full Project Archive (Opens in a new tab)",
  "SEND": "Send message",
  "SHORT_DESCRIPTION": "I'm focused on creating accessible and scalable web applications.",
  "SUCCESS_MESSAGE": "Thank you for your message. It has been sent successfully!",
  "TOGGLE_MODE": "Toggle dark/light mode",
  "TOGGLE_LANGUAGE": "Toggle language (English/French)",
  "WEB_DEVELOPER": "Web Developer",
  "YOUR_MESSAGE": "Your message"
}
